# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Recursividade}
#+latex: \mytitleslide

* Código: _fatorial_

#+attr_latex: :options fontsize=\normalsize
#+BEGIN_SRC C :tangle e/a40-fat.c
#include <stdio.h>
int fatorial (int n) {
  int fat;
  if (n == 0)
    fat = 1; // encerra a recursão e inicia o retorno
  else
    fat = n * fatorial(n-1); // chamada recursiva
  return fat; // retorna fatorial
}
int main() {
  printf("%d\n", fatorial(4));
  return 0;
}
#+END_SRC

#+RESULTS:
: 24

